Reports/бит_КарточкаРасчетовПоЛицевомуСчету.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_КарточкаРасчетовПоЛицевомуСчету</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМакет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_КарточкаРасчетовПоЛицевомуСчету/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеЭлементами();
	
	СписокДоступныхЗначение = Элементы.ТипОтчета.СписокВыбора;
	СписокДоступныхЗначение.Добавить(Ложь  , "Схема компоновки данных");
	СписокДоступныхЗначение.Добавить(Истина, "Макет");
	
	Если Параметры.Свойство("ЛицевойСчет") Тогда
		Отчет.ЛицевойСчет = Параметры.ЛицевойСчет;
	КонецЕсли;
	
	Если Параметры.Свойство("НачалоПериода") Тогда
		Отчет.НачалоПериода = Параметры.НачалоПериода;
	КонецЕсли;
	
	Если Параметры.Свойство("КонецПериода") Тогда
		Отчет.КонецПериода = Параметры.КонецПериода;
	КонецЕсли;
	
	Если Параметры.Свойство("СформироватьОтчет") Тогда
		ТипОтчета               = Параметры.СформироватьОтчет;
		Отчет.ИспользоватьМакет = Параметры.СформироватьОтчет;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыУправленияВидимостьюЭлементовФормы

&НаСервере
Процедура УправлениеЭлементами()
	
	Элементы.ФормаСформировать.Видимость = НЕ Отчет.ИспользоватьМакет;
	Элементы.ФормаСформировать.КнопкаПоУмолчанию = НЕ Отчет.ИспользоватьМакет;
	
	Элементы.ФормаСформироватьМакет.Видимость         = Отчет.ИспользоватьМакет;
	Элементы.ФормаСформироватьМакет.КнопкаПоУмолчанию = Отчет.ИспользоватьМакет;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура СформироватьМакет(Команда)
	
	ВызватьСформироватьОтчет();
	
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "НастройкаПериода".
//
&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	Период = Новый СтандартныйПериод;
	Период.ДатаНачала    = Отчет.НачалоПериода;
	Период.ДатаОкончания = Отчет.КонецПериода;
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогРедактированияПериода.Период = Период;
	
	ДиалогРедактированияПериода.Показать(Новый ОписаниеОповещения("НастройкаПериодаЗавершение", ЭтотОбъект, Новый Структура("ДиалогРедактированияПериода", ДиалогРедактированияПериода))); 
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаПериодаЗавершение(Период1, ДополнительныеПараметры) Экспорт
    
    ДиалогРедактированияПериода = ДополнительныеПараметры.ДиалогРедактированияПериода;
    
    Если ЗначениеЗаполнено(Период1) Тогда
        
        Отчет.НачалоПериода = ДиалогРедактированияПериода.Период.ДатаНачала;
        Отчет.КонецПериода  = ДиалогРедактированияПериода.Период.ДатаОкончания;
        
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	
	Элементы.Настройки.Пометка = НЕ Элементы.Настройки.Пометка;
	
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Элементы.Настройки.Пометка;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ТипОтчетаПриИзменении(Элемент)
	
	Отчет.ИспользоватьМакет = ТипОтчета;
	// БИТ_ЖКХ 22.09.2015 17:16:09 Начало правки... На тонком клиенте можно очищать только области. 
	//Результат.Область().Очистить(Истина, Истина, Истина); //Остаются следы группировок на полях
	ОчиститьРезультат();
	//Результат.Очистить();
	// БИТ_ЖКХ 22.09.2015 17:16:11 Конец правки. 
	УправлениеЭлементами();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

&НаСервере
Процедура ВызватьСформироватьОтчет()
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат);
	
КонецПроцедуры

// БИТ_ЖКХ 22.09.2015 17:31:39 Начало правки...
&НаСервере
Процедура ОчиститьРезультат()
	
	Результат.Очистить();
	
КонецПроцедуры
// БИТ_ЖКХ 22.09.2015 17:31:39 Конец правки.

#КонецОбласти
